tutorials/compressible/rhoPimpleFoam/RAS/annularThermalMixer/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "<constant>/caseSettings"

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
{
    inlet
    {
        $/inlet/p;
    }

    outlet
    {
        $/outlet/p;
    }

    staticWalls
    {
        $/wall/p;
    }

    movingWalls
    {
        $staticWalls;
    }

    #includeEtc "caseDicts/setConstraintTypes"
}


// ************************************************************************* //
